Catalogs/ДополнительныеКолонкиСписковЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДополнительныеКолонкиСписковЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПутиКЗначениямДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПутиКЗначениямДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПутьКЗначению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьЗаполненияДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьЗаполненияДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ДополнительныеКолонкиСписковЗадач/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьОтображение(Команда)
	ВключитьОтображениеКолонок(Элементы.Список.ВыделенныеСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтображение(Команда)
	ОтключитьОтображениеКолонок(Элементы.Список.ВыделенныеСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьЗаполнениеКолонок(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаполненииКолонок", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Будет запланировано заполнение значений дополнительных колонок задач. Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Колонки = Новый СписокЗначений;
	Колонки.ЗагрузитьЗначения(ДополнительныеКолонкиСписковЗадач());
	Для Каждого Колонка Из Колонки Цикл
		Колонка.Пометка = Истина;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиКолонок", ЭтотОбъект);
	Колонки.ПоказатьОтметкуЭлементов(Оповещение, "Отметьте колонки для выгрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ОткрытьФорму("Справочник.ДополнительныеКолонкиСписковЗадач.Форма.ФормаЗагрузки", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипыКолонок(Команда)
	
	ОбновитьТипыКолонокНаСервере();
	
	ТекстСообщения = НСтр("ru = 'Типы дополнительных колонок обновлены'");
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Успешно32);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВключитьОтображениеКолонок(Знач Колонки)
	
	ВключитьОтображениеКолонокСервер(Колонки);
	
	Если Колонки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьОтображениеКолонокСервер(Колонки)
	
	ВключенныеКолонки = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Колонка Из Колонки Цикл
			
			Если ТипЗнч(Колонка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Колонка, "ПометкаУдаления") Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Колонка ""%1"" не может быть отображена: установлена пометка удаления'"),
					Колонка);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			ПроцессыОбработкиДокументов.ВключитьОтображениеКолонки(Колонка);
			
			ВключенныеКолонки.Добавить(Колонка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Колонки = ВключенныеКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтображениеКолонок(Знач Колонки)
	
	ОтключитьОтображениеКолонокСервер(Колонки);
	
	Если Колонки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтключитьОтображениеКолонокСервер(Колонки)
	
	ОтключенныеКолонки = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Колонка Из Колонки Цикл
			
			Если ТипЗнч(Колонка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			ПроцессыОбработкиДокументов.ОтключитьОтображениеКолонки(Колонка);
			
			ОтключенныеКолонки.Добавить(Колонка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Колонки = ОтключенныеКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаполненииКолонок(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьЗаполнениеДополнительныхКолонокЗадач();
	
	ТекстСообщения = НСтр("ru = 'Запланировано заполнение значений дополнительных колонок задач'");
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьЗаполнениеДополнительныхКолонокЗадач()
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ЗаблокироватьРегистрОчередьЗаполненияДополнительныхКолонокЗадач();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПутиКЗначениямДополнительныхКолонокЗадач.Колонка КАК Колонка,
		|	ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач";
		
		НаборЗаписей = РегистрыСведений.ОчередьЗаполненияДополнительныхКолонокЗадач.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
		НаборЗаписей.Записать();
		
		ПроцессыОбработкиДокументов.ВключитьЗаполнениеДополнительныхКолонокЗадач();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДополнительныеКолонкиСписковЗадач()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеКолонкиСписковЗадач.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеКолонкиСписковЗадач КАК ДополнительныеКолонкиСписковЗадач";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиКолонок(Список, Параметры) Экспорт
	
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиДляВыгрузки = Новый Массив;
	
	Для Каждого Элемент из Список Цикл
		Если Элемент.Пометка Тогда
			КолонкиДляВыгрузки.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкиДляВыгрузки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выгрузка отменена: не отмечено ни одной колонки'");
		ПоказатьОповещениеПользователя(,,ТекстСообщения, БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСохранениеКолонокВФайл(КолонкиДляВыгрузки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСохраненияКолонок", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьСохранениеКолонокВФайл(Колонки)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"ФоновыеЗаданияПроцессыОбработкиДокументов.ВыполнитьВыгрузкуДополнительныхКолонокСписковЗадач",
		Колонки);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСохраненияКолонок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("АдресРезультата", Результат.АдресРезультата);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияКолонок", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru='Файлы XML'")+"(*.xml)|*.xml";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл для сохранения колонок'");
	
	ПараметрыСохранения.Диалог = ДиалогОткрытияФайла;
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, "ДополнительныеКолонкиЗадач.xml", ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияКолонок(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресРезультата);
	
	Если ПолученныеФайлы <> Неопределено Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Дополнительные колонки выгружены в файл ""%1""'"),
			ПолученныеФайлы[0].ПолноеИмя);
		ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Успешно32);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьТипыКолонокНаСервере()
	
	ПроцессыОбработкиДокументов.ОбновитьТипыДополнительныхКолонок();
	
КонецФункции

#КонецОбласти
